---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.IDuctFittingAndAccessoryPressureDropServer.IsApplicable(Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData)
source: html/8f7bafb6-6188-7c69-5405-806f02d8c873.htm
---
# Autodesk.Revit.DB.Mechanical.IDuctFittingAndAccessoryPressureDropServer.IsApplicable Method

Check if the server is applicable for the duct fitting or duct accessory.

## Syntax (C#)
```csharp
bool IsApplicable(
	DuctFittingAndAccessoryPressureDropData data
)
```

## Parameters
- **data** (`Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData`) - The input data of the calculation.